import { Stack } from "@chakra-ui/react";
import Link from "next/link";

export default function VerificationPending() {
  return (
    <Stack minH={"100vh"}>
      <h1>Баталгаажуулалт хүлээгдэж байна</h1>
      <p>
        Таны и-мэйл хаяг руу баталгаажуулах холбоос илгээгдлээ. И-мэйлээ
        шалгаад, баталгаажуулах холбоос дээр дарна уу.
      </p>
      <p>Хэрэв та и-мэйл хүлээж аваагүй бол:</p>
      <ul>
        <li>Спам хавтсаа шалгана уу</li>
        <li>Таны оруулсан и-мэйл хаяг зөв эсэхийг шалгана уу</li>
        <li>
          Хэрэв та баталгаажуулах и-мэйл хүлээж аваагүй хэвээр байвал бидэнтэй
          холбогдоно уу
        </li>
      </ul>
      <Link href="/">
        <button>Нүүр хуудас руу буцах</button>
      </Link>
    </Stack>
  );
}
